# 自有服务

--------

自有服务，即不需要用户独立去安装的软件的服务，而是当系统安装好之后就可以直接使用的服务（内置）。

## 关机和重启

------

#### 重启命令：

- `reboot`
- `shutdown -r now` 立刻重启 (root用户使用)
- `shutdown -r 10` 过10分钟自动重启 (root用户使用)
- `shutdown -r 20:35` 在时间为20:35时候重启 (root用户使用)

#### 关机命令：

- `halt`  立刻关机
- `poweroff` 立刻关机
- `shutdown -h now` 立刻关机(root用户使用)
- `shutdown -h 10` 10分钟后自动关机

## 运行模式

-------

运行模式也可以称之为运行级别。在linux中存在一个进程：`init (initialize，初始化)`，进程 `id` 是 `1`。

查看进程：`#ps -ef|grep init`

```bash
> ps -ef | head
  UID   PID  PPID   C STIME   TTY           TIME CMD
    0     1     0   0  1 170  ??         8:42.78 /sbin/init
```

该进程存在一个对应的配置文件：`inittab`（系统运行级别配置文件，位置 `/etc/inittab`）

> **根据上述的描述，可以得知，Centos6.5中存在7中运行级别/模式。**
>
> - `0` — 表示关机级别（不要将默认的运行级别设置成这个值）
> - `1` — 单用户模式
> - `2` — 多用户模式，不带NFS（Network File Syetem）
> - `3` — 多用户模式，完全的多用户模式（不带桌面的，纯命令行模式）
> - `4` — 没有被使用的模式（被保留模式）
> - `5` — X11，完整的图形化界面模式
> - `6` — 表示重启级别（不要将默认的运行级别设置成这个值）

**注意：init指令需要超级管理员的权限，普通用户无法执行。**

这些命令其实都是调用的 `init` 进程，将数字（运行级别）传递给进程，进程去读配置文件执行对应的操作。

通过`init` 命令切换模式都是临时切换，重启之后又恢复，想设置模式永久为命令行模式，需要将 `/etc/inittab` 文件中的 `initdefault` 值设置成 `3`，然后重启操作系统。

## 主机名

-------

#### 设置主机名

- 指令：
  - `#hostname`
  - `#hostname -f` FQDN（全限定域名）


**临时设置主机名**

临时设置主机名（立竿见影），需要切换用户使之生效

```bash
> hostname patrick
> hostname
# patrick
```

**永久设置主机名**

修改 `/etc/sysconfig/network`（主机名的配置文件），修改其中的 `HOSTNAME` 为自己需要设置的永久主机名。

```bash
NETWORKING_IPV6=no
PEERNTP=no
HOSTNAME=patrick
```

修改 `linux` 服务器的 `hosts` 文件，将主机名指向本地（设置 `FQDN` ），`Hosts` 文件的位置：`/etc/hosts`。

```bash
127.0.0.1 localhost  localhost patrick
::1         localhost localhost.localdomain localhost6 localhost6.localdomain6
172.16.23.65 inno  inno
```

**问题：** 

不设置 `FQDN` 会怎么样？

- 很多开源服务器软件（例如Apache）则无法启动，或出现报错；
- 如果不设置则会影响本地的域名的解析(本地访问);

## 系统信息

--------

#### lsb_release

查看内核信息，操作系统发行版本：

```bash
> lsb_release -a
# LSB Version:	:core-4.1-amd64:core-4.1-noarch
# Distributor ID:	CentOS
# Description:	CentOS Linux release 7.7.1908 (Core)
# Release:	7.7.1908
# Codename:	Core
```

## 时间管理

--------

#### date

- 作用：表示操作时间日期（读取、设置）
- 语法1：#date			输出的形式：2018年 3月 24日 星期六 15:54:28

```bash
/var/log 
➜ date
2020年 2月17日 星期一 17时08分31秒 CST
```

- 语法2：#date  +%F	（等价于`#date  "+%Y-%m-%d"` ）	输出形式：2018-03-24

```bash
/var/log 
➜ date +%F
2020-02-17
```

- 语法3：`#date  "+%F %T"` ， 引号表示让“年月日与时分秒”成为一个不可分割的整体
  - 等价操作#date  “+%Y-%m-%d %H:%M:%S”
  - 输出的形式：2018-03-24 16:01:00

```bash
/var/log 
➜ date "+%F %T"
2020-02-17 17:11:46
```

- 语法4：获取之前或者之后的某个时间（备份）
- #date  -d  “-1 day”  “+%Y-%m-%d %H:%M:%S”

 ```bash
/var/log 
➜ date -d "-1 day" "+%Y-%m-%d %H:%M:%S"
 ```

符号的可选值：+（之后） 或者 - （之前）

单位的可选值：day（天）、month（月份）、year（年）

>  %F：表示完整的年月日
>
>  %T：表示完整的时分秒
>
>  %Y：表示四位年份
>
>  %m：表示两位月份（带前导0）
>
>  %d：表示日期（带前导0）
>
>  %H：表示小时（带前导0）
>
>  %M：表示分钟（带前导0）
>
>  %S：表示秒数（带前导0）

#### cal

- 作用：用来操作日历的
- 语法1：#cal	  等价于 #cal  -1		直接输出当前月份的日历

```bash
/var/log 
➜ cal
      二月 2020
日 一 二 三 四 五 六
                   1
 2  3  4  5  6  7  8
 9 10 11 12 13 14 15
16 17 18 19 20 21 22
23 24 25 26 27 28 29
```

- 语法2：#cal  -3			表示输出上一个月+本月+下个月的日历

```bash
/var/log 
➜ cal -3
                            2020
         一月                    二月                    三月
日 一 二 三 四 五 六  日 一 二 三 四 五 六  日 一 二 三 四 五 六
          1  2  3  4                     1   1  2  3  4  5  6  7
 5  6  7  8  9 10 11   2  3  4  5  6  7  8   8  9 10 11 12 13 14
12 13 14 15 16 17 18   9 10 11 12 13 14 15  15 16 17 18 19 20 21
19 20 21 22 23 24 25  16 17 18 19 20 21 22  22 23 24 25 26 27 28
26 27 28 29 30 31     23 24 25 26 27 28 29  29 30 31
```

- 语法3：#cal  -y 年份  		表示输出某一个年份的日历

#### ntp

时间是对服务器来说是很重要的，一般很多网站都需要读取服务器时间来记录相关信息，如果时间不准，则可能造成很大的影响。`ntp` 主要是用于对计算机的时间同步管理操作。

一次性同步时间（简单）

- 语法：`#ntpdate` 时间服务器的域名或ip地址

```bash
> ntpdate -u time.pool.aliyun.com
```

设置时间同步服务，启动ntpd服务：
- 语法：#service ntpd start   或者  /etc/init.d/ntpd start

```bash
> service ntpd start
# Redirecting to /bin/systemctl start  ntpd.service
```

设置 `ntpd` 服务开机启动：
- \# `chkconfig --list|grep ntpd`
- \# `chkconfig --level 35 ntpd on`

```bash
> chkconfig --level 35 ntpd on
# 注意：正在将请求转发到“systemctl enable ntpd.service”。
```

设置 `crontab` 定时更新：

```bash
0 12 * * * * /usr/sbin/ntpdate time.pool.aliyun.com
```

## Cron/Crontab定时任务

-------

作用：操作系统不可能24小时都有人在操作，有些时候想在指定的时间点去执行任务（例如：每天夜里2点去重新启动Apache），此时不可能真有人每天夜里2点去执行命令，此时可以交给计划任务程序去执行操作。

- 语法：#crontab 选项
- 常用选项：
  - **-l**：list，列出指定用户的计划任务列表
  - **-e**：edit，编辑指定用户的计划任务列表
  - **-u**：user，指定的用户名，如果不指定，则表示当前用户
  - **-r**：remove，删除指定用户的计划任务列表

#### 列出

```bash
[root@inno cron]# crontab -l
0 0 * * * "date >> dataCron.log 2>&1"
```

#### 编辑

**计划任务的规则语法格式，以行为单位，一行则为一个计划：**
$$
min ~hour ~day ~month ~week ~[commad ~to ~do]
$$

```bash
[root@inno cron]# crontab -e
no crontab for root - using an empty one
crontab: installing new crontab
```

**取值范围：**

- 分：0~59
- 时：0~23
- 日：1~31
- 月：1~12
- 周：0~7，0和7表示星期天

**四个符号：**

- \*：表示取值范围中的每一个数字。
- -：做连续区间表达式的，要想表示1~7，则可以写成：1-7。
- /：表示每多少个，例如：想每10分钟一次，则可以在分的位置写：*/10。
- ,：表示多个取值，比如想在1点，2点6点执行，则可以在时的位置写：1,2,6。

> **Crontab权限问题：**
>
> 本身是任何用户都可以创建自己的计划任务，但是超级管理员可以通过配置来设置某些用户不允许设置计划任务，配置文件位于黑名单：/etc/cron.deny里面写用户名，一行一个.
>
> 还有一个配置文件白名单：/etc/cron.allow（本身不存在，自己创建）
>
> **注意：**
>
> 白名单优先级高于黑名单，如果一个用户同时存在两个名单文件中，则会被默认允许创建计划任务。
